/**
 * 
 */
package com.yisi.framework.common;

/**
 * 功能说明：接口返回代码
 * @author baishui
 * @2016年6月27日 下午3:02:20
 *
 * @com.jzy.intf.common.ReturnCode.java
 */
public enum ReturnCode {

	/**
	 * 获取成功
	 */
	CODE200(200,"请求成功"),
	/**
	 * 保存成功
	 */
	CODE201(201,"保存成功"),
	/**
	 * 更新成功
	 */
	CODE202(202,"更新成功"),
	
	/**
	 * 用户中心服务器请求失败
	 */
	CODE405(405,"用户中心服务器请求失败"),
	/**
	 * 操作对象找不到主键ID
	 */
	CODE406(406,"操作对象找不到主键ID"),
	/**
	 * 对象主键ID找不到实体类型
	 */
	CODE407(407,"对象主键ID找不到实体类型"),
	/**
	 * 获取失败
	 */
	CODE404(404,"获取失败"),
	/**
	 * 实体类验证失败
	 */
	CODE501(501,"实体类验证失败"),
	/**
	 * 手机号码为空
	 */
	CODE301(301,"手机号码为空"),
	/**
	 * 短信发送失败
	 */
	CODE302(302,"短信发送失败"),
	/**
	 * 图片类型错误
	 */
	CODE303(303,"图片类型错误"),
	/**
	 * 图片类型为空
	 */
	CODE304(304,"图片类型为空"),
	/**
	 * 图片保存失败
	 */
	CODE305(305,"图片保存失败"),
	/**
	 * 用户手机号码或者密码为空
	 */
	CODE306(306,"用户手机号码或者密码为空"),
	/**
	 * 用户保存失败
	 */
	CODE307(307,"用户保存失败"),
	/**
	 * 当前手机已注册
	 */
	CODE308(308,"当前手机号码已注册"),
	/**
	 * 用户ID为空
	 */
	CODE309(309,"用户ID为空"),
	/**
	 * 用户不存在
	 */
	CODE310(310,"用户id不存在用户"),
	/**
	 * 地址id不存在
	 */
	CODE311(311,"地址id不存在"),
	/**
	 * 用户手机号码或者密码为空
	 */
	CODE312(312,"用户手机号码或者密码为空"),
	/**
	 * 手机对应的用户不存在
	 */
	CODE313(313,"手机对应的用户不存在"),
	/**
	 * 用户名密码错
	 */
	CODE314(314,"用户名密码错"),
	/**
	 * 操作金额有误
	 */
	CODE315(315,"操作金额有误"),
	/**
	 * 用户余额不足
	 */
	CODE316(316,"用户余额不足"),
	/**
	 * 提现方式为空
	 */
	CODE317(317,"提现方式为空"),

	/**
	 * 充值方式为空
	 */
	CODE318(318,"充值方式为空"),
	/**
	 * 验证码错误
	 */
	CODE319(319,"验证码错误"),
	/**
	 * 品类ID为空
	 */
	CODE320(320,"品类ID为空"),
	/**
	 * 服务ID为空
	 */
	CODE321(321,"服务ID为空"),
	/**
	 * 用户旧二级密码有误
	 */
	CODE322(322,"原支付密码错误"),
	/**
	 * 推荐码不存在用户
	 */
	CODE323(323,"推荐码不存在用户"),

	/**
	 * 返回信息为空
	 */
	CODE400(400,"返回信息为空"),
	
	/**
	 * 操作失败
	 */
	CODE401(401,"操作失败"),
	
	;
	
	private String msg;	
	private int code;	// 构造方法
	
	private ReturnCode(int code, String msg) {
		this.code = code;
		this.msg = msg;
	}
	public String getMsg() {
		return msg;
	}

	public void setMsg(String msg) {
		this.msg = msg;
	}

	public int getCode() {
		return code;
	}

	public void setCode(int code) {
		this.code = code;
	}
}
